package com.ahzx.baohanapi.common.enums;

import lombok.Getter;
import lombok.ToString;

@Getter
@ToString
public enum  AreaEnum {

    HFS(340100,"合肥市"),
    YHQ(340102,"瑶海区"),
    LYQ(340103,"庐阳区"),
    SSQ(340104,"蜀山区"),
    BHQ(340111,"包河区"),
    CFX(340121,"长丰县"),
    FDX(340122,"肥东县"),
    FXX(340123,"肥西县"),
    LJX(340124,"庐江县"),
    HFGXJSCYKFQ(340171,"合肥高新技术产业开发区"),
    HFJJJSKFQ(340172,"合肥经济技术开发区"),
    HFXZGXJSCYKFQ(340173,"合肥新站高新技术产业开发区"),
    CHS(340181,"巢湖市"),

    WHS(340200,"芜湖市"),
    JHQ(340202,"镜湖区"),
    JJQ(340207,"鸠江区"),
    YJQ(340209,"弋江区"),
    WZQ(340210,"湾沚区"),
    FCQ(340212,"繁昌区"),
    NLX(340223,"南陵县"),
    WHJJJSKFQ(340271,"芜湖经济技术开发区"),
    AHWHSSJJKFQ(340272,"安徽芜湖三山经济开发区"),
    WWS(340281,"无为市"),

    BBS(340300,"蚌埠市"),
    LZHQ(340302,"龙子湖区"),
    BSQ(340303,"蚌山区"),
    YUHQ(340304,"禹会区"),
    HSQ(340311,"淮上区"),
    HYX(340321,"怀远县"),
    WHX(340322,"五河县"),
    GZX(340323,"固镇县"),
    BBSGXJSKFQ(340371,"蚌埠市高新技术开发区"),
    BBSJJKFQ(340372,"蚌埠市经济开发区"),

    HNS(340400,"淮南市"),
    DTQ(340402,"大通区"),
    TJAQ(340403,"田家庵区"),
    XJJQ(340404,"谢家集区"),
    BGSQ(340405,"八公山区"),
    PJQ(340406,"潘集区"),
    FTX(340421,"凤台县"),
    SX(340422,"寿县"),

    MASS(340500,"马鞍山市"),
    HUASQ(340503,"花山区"),
    YSQ(340504,"雨山区"),
    BWQ(340506,"博望区"),
    DTX(340521,"当涂县"),
    HSX(340522,"含山县"),
    HX(340523,"和县"),

    HBS(340600,"淮北市"),
    DJQ(340602,"杜集区"),
    XSQ(340603,"相山区"),
    LSQ(340604,"烈山区"),
    SXX(340621,"濉溪县"),

    TLS(340700,"铜陵市"),
    TGQ(340705,"铜官区"),
    YAQ(340706,"义安区"),
    JQ(340711,"郊区"),
    CYX(340722,"枞阳县"),

    AQS(340800,"安庆市"),
    YINGJQ(340802,"迎江区"),
    DGQ(340803,"大观区"),
    YXQ(340811,"宜秀区"),
    HNX(340822,"怀宁县"),
    THX(340825,"太湖县"),
    SSX(340826,"宿松县"),
    WJX(340827,"望江县"),
    YXX(340828,"岳西县"),
    AHAQJJKFQ(340871,"安徽安庆经济开发区"),
    TCS(340881,"桐城市"),
    QSS(340882,"潜山市"),

    HSS(341000,"黄山市"),
    TXQ(341002,"屯溪区"),
    HUANGSQ(341003,"黄山区"),
    HZQ(341004,"徽州区"),
    XX(341021,"歙县"),
    XNX(341022,"休宁县"),
    YX(341023,"黟县"),
    QMX(341024,"祁门县"),

    CZS(341100,"滁州市"),
    LANGYQ(341102,"琅琊区"),
    NQQ(341103,"南谯区"),
    LAX(341122,"来安县"),
    QJX(341124,"全椒县"),
    DYX(341125,"定远县"),
    FYX(341126,"凤阳县"),
    ZXSCGXJSCYKFQ(341171,"中新苏滁高新技术产业开发区"),
    CZJJJSKFQ(341172,"滁州经济技术开发区"),
    TIANCS(341181,"天长市"),
    MGS(341182,"明光市"),

    FYS(341200,"阜阳市"),
    YZQ(341202,"颍州区"),
    YDQ(341203,"颍东区"),
    YQQ(341204,"颍泉区"),
    LQX(341221,"临泉县"),
    TAIHX(341222,"太和县"),
    FNX(341225,"阜南县"),
    YSX(341226,"颍上县"),
    FYHFXDCYYQ(341271,"阜阳合肥现代产业园区"),
    FYJJJSKFQ(341272,"阜阳经济技术开发区"),
    JSS(341282,"界首市"),

    SZS(341300,"宿州市"),
    YONGQQ(341302,"埇桥区"),
    DSX(341321,"砀山县"),
    XIAOX(341322,"萧县"),
    LBX(341323,"灵璧县"),
    SIX(341324,"泗县"),
    SZMASXDCYYQ(341371,"宿州马鞍山现代产业园区"),
    SZJJJSKFQ(341372,"宿州经济技术开发区"),

    LAS(341500,"六安市"),
    JAQ(341502,"金安区"),
    YUAQ(341503,"裕安区"),
    YEJQ(341504,"叶集区"),
    HQX(341522,"霍邱县"),
    SCX(341523,"舒城县"),
    JZX(341524,"金寨县"),
    HUOSX(341525,"霍山县"),

    HZS(341600,"毫州市"),
    QCS(341602,"谯城市"),
    WYX(341621,"涡阳县"),
    MCX(341622,"蒙城县"),
    LXX(341623,"利辛县"),

    CHIZS(341700,"池州市"),
    GCQ(341702,"贵池区"),
    DZX(341721,"东至县"),
    STX(341722,"石台县"),
    QYX(341723,"青阳县"),

    XCQ(341800,"宣城市"),
    XZQ(341802,"宣州区"),
    LANGXX(341821,"郎溪县"),
    JX(341823,"泾县"),
    JXX(341824,"绩溪县"),
    JDX(341825,"旌德县"),
    XCSJJKFQ(341871,"宣城市经济开发区"),
    NGS(341881,"宁国市"),
    GDS(341882,"广德市"),

    ;

    private Integer areaCode;
    private String areaName;

    AreaEnum(Integer areaCode, String areaName) {
        this.areaCode = areaCode;
        this.areaName = areaName;
    }

}
